# -*- mode: org; -*- 
#+STARTUP: indent overview align
#+OPTIONS: toc:nil num:nil title:nil \n:t author:nil ::nil H:1 f:nil 
#+TITLE: test.org
#+AUTHOR: c.p.brown
#+SUBTITLE: Break orgqq. I release when the TODOs are gone
#+TODO: [2_FIX.] [0_TODO] [1_IP..] [3_WAIT] [4_NOPE] [5_DONE]

** [5_DONE] plot table                                               :table:
#+BEGIN_TABLE
| temp c | temp f |   fn | plot                 | note       |
|--------+--------+------+----------------------+------------|
|    0.0 |   32.0 | 0.00 |                      |            |
|    2.0 |   35.6 | 0.00 |                      |            |
|    4.0 |   39.2 | 0.01 | ▎                    |            |
|    6.0 |   42.8 | 0.01 | ▎                    |            |
|    8.0 |   46.4 | 0.02 | ▍                    |            |
|   10.0 |   50.0 | 0.03 | ▋                    |            |
|   12.0 |   53.6 | 0.05 | █                    | <- heater  |
|   14.0 |   57.2 | 0.08 | █▋                   |            |
|   16.0 |   60.8 | 0.14 | ██▊                  | <- coat    |
|   18.0 |   64.4 | 0.22 | ████▍                |            |
|   20.0 |   68.0 | 0.33 | ██████▋              |            |
|   22.0 |   71.6 | 0.46 | █████████▎           | <- perfect |
|   24.0 |   75.2 | 0.61 | ████████████▎        |            |
|   26.0 |   78.8 | 0.73 | ██████████████▋      |            |
|   28.0 |   82.4 | 0.83 | ████████████████▋    | <- fan     |
|   30.0 |   86.0 | 0.89 | █████████████████▊   |            |
|   32.0 |   89.6 | 0.94 | ██████████████████▊  | <- aircon  |
|   34.0 |   93.2 | 0.96 | ███████████████████▎ |            |
|   36.0 |   96.8 | 0.98 | ███████████████████▋ |            |
|   38.0 |  100.4 | 0.99 | ███████████████████▊ |            |
|   40.0 |  104.0 | 0.99 | ███████████████████▊ |            |
|   42.0 |  107.6 | 1.00 | ████████████████████ |            |
|   44.0 |  111.2 | 1.00 | ████████████████████ |            |
|--------+--------+------+----------------------+------------|
#+TBLFM: $2=(($1*1.8)+32);%.1f :: $3=(1/(1+exp(-($1-(0.0 + ((50.0/10.0)*4.5)))/(50.0/10.0)*0.7)));%.2f :: $4='(orgtbl-uc-draw-cont $3 0.0 1.0 20) 
#+END_TABLE
** [5_DONE] ultra wide table                                         :table:
- [X] set font size range using line character length
#+BEGIN_TABLE
| 1ITM |   2BBB |    3CCC |       4DDD |       5EEE | 6FFF | 7GGG | 8HHH | 9III | 10JJJ |      11KKK |    12LLL |      13MMM |      14NNN |
|------+--------+---------+------------+------------+------+------+------+------+-------+------------+----------+------------+------------|
| ONE  | 300000 |  900000 |     100000 |  800000.00 | 0.97 | 0.98 |  0.0 | 0.51 | 20000 |  737540.00 |    13.56 |  695000.00 |  855540.00 |
| TWO  | 200000 |  100000 |     100000 |       0.00 | 0.97 |  1.0 |  0.0 | 0.51 |  5000 |   -8000.00 | -1250.00 | 1440540.00 |   97000.00 |
| TRE  | 600000 |  800000 |     400000 |  400000.00 | 0.97 |  1.0 |  0.0 | 0.51 | 20000 |  356000.00 |   112.36 |  776540.00 |  776000.00 |
| FOR  | 800000 | 1100000 |     600000 |  500000.00 | 0.97 |  1.0 |  0.0 | 0.51 | 20000 |  447000.00 |   134.23 |  485540.00 | 1067000.00 |
|------+--------+---------+------------+------------+------+------+------+------+-------+------------+----------+------------+------------|
|      |        |         | 1200000.00 | 1700000.00 |      |      |      |      |       | 1532540.00 |    78.30 |            |            |
#+TBLFM: $5=($3-$4);%.2f :: $11=( (((($3*$6) - $4)*$7) - max((($3-$2)*($8*$9)),0.0)) - $10);%.2f :: $12=($4/$11)*100.0;%.2f :: @>$4=vsum(@I$4..@II$4);%.2f :: @>$5=vsum(@I$5..@II$5);%.2f :: @>$11=vsum(@I$11..@II$11);%.2f :: @>$12=(@>$4/@>$11)*100.0;%.2f :: $13=((vsum(@I$11..@II$11)-$11)-$4);%.2f :: @>$13=(string("")) :: $14=((($3*$6)*$7)-max((($3-$2)*($8*$9)),0.0));%.2f :: @>$14=(string(""))
#+END_TABLE
** [5_DONE] subtotal table                                      :table:link:
#+BEGIN_TABLE
#+tblname: with-rownames
| !     | DESCRIPTION   |       SUB |
|-------+---------------+-----------|
| AAA02 | ideas         |  12340.56 |
| BBB15 | words         |  56780.90 |
| CCC35 | [[source code]]   |  12340.00 |
| CCC39 | actions       |  56780.00 |
| CCC40 | actions       |   9100.00 |
|-------+---------------+-----------|
|       | 147341.46     |           |
| ^     | income_total  |           |
|-------+---------------+-----------|
| OFCIE | screen        |  -1230.00 |
| TOOLS | wares         |  -4560.00 |
| TOOLS | more wares    |   -789.62 |
| COMMS | newphone      |  -1000.74 |
|-------+---------------+-----------|
|       | -7580.36      |           |
| ^     | expense_total |           |
|-------+---------------+-----------|
| TOTAL |               | 139761.10 |
| %     |               |      95.6 |
#+TBLFM: @1$1=string("!") :: @1$2=string("DESCRIPTION") ::  $income_total=vsum(@I$SUB..@II$SUB);%.2f :: $expense_total=vsum(@III$SUB..@IIII$SUB)  :: @>>$3=vsum(@I$SUB..@IIII$SUB);%.2f ::  @>$3=(1.0 - (abs(@IIII$2) / @II$2)) * 100.0;%.1f
#+END_TABLE
** [5_DONE] columnviews                                              :table:
escaped using BEGIN_EXAMPLE and comma before asterisk:
#+BEGIN_EXAMPLE
,* alist
  :PROPERTIES:
  :COLUMNS: %ITM %COS %QTY
  :END:

,** anitem
   :PROPERTIES:
   :ITM: one
   :COS: 34.80
   :QTY: 3
   :URL: storepage.com/one
   :END:

,** anotheritem
   :PROPERTIES:
   :ITM: two
   :COS: 7.50
   :QTY: 12
   :URL: storepage.com/two
   :END:

,** lastitem
   :PROPERTIES:
   :ITM: three
   :COS: 68.00
   :QTY: 8
   :URL: storepage.com/three
   :END:

,** line
   :PROPERTIES:
   :ITM: -
   :COS:
   :QTY:
   :URL:
   :END:

,** total
   :PROPERTIES:
   :ITM: Total
   :COS:
   :QTY:
   :URL:
   :END:

,** table
   #+BEGIN: columnview :id local :skip-empty-rows t
   | ITM   |   COS |   QTY |
   |-------+-------+-------|
   | one   | 34.80 |     3 |
   | two   |  7.50 |    12 |
   | three | 68.00 |     8 |
   |-------+-------+-------|
   | Total |       | 23.00 |
   #+TBLFM: @>$3=vsum(@I$3..@II$3);%.2f
   #+END
#+END_EXAMPLE
**** summary                                                       :table:
   #+BEGIN: columnview :id local :skip-empty-rows t
   | ITM   |   COS |   QTY |
   |-------+-------+-------|
   | one   | 34.80 |     3 |
   | two   |  7.50 |    12 |
   | three | 68.00 |     8 |
   |-------+-------+-------|
   | Total |       | 23.00 |
   #+TBLFM: @>$3=vsum(@I$3..@II$3);%.2f
   #+END
